import React from 'react';
import {
  BrowserRouter as Router,
  Route,
  Link
} from 'react-router-dom'

import Carousel from '../components/Carousels';


function getArticleById (id) {
	return id;
}


const Article =( match ) => {
	const Article = getArticleById(match.params.id);
	return (
		<div>
			<h1>{Article}</h1>
			<p>《水浒传》以农民起义的发生、发展过程为主线，通过各个英雄被逼上梁山的不同经历，描写出他们由个体觉醒到走上小规模联合反抗，到发展为盛大的农民起义队伍的全过程，表现了“官逼民反”这一封建时代农民起义的必然规律，塑造了农民起义领袖的群体形象，深刻反映出北宋末年的政治状况和社会矛盾。
				作者站在被压迫者一边，歌颂了农民起义领袖们劫富济贫、除暴安良的正义行为，肯定了他们敢于造反、敢于斗争的革命精神。宋江原是一位周急扶困的义士，当他被逼上梁山之后，“替天行道”，壮大了起义军的声威，取得了一系列胜利。但由于他性格的二重性和思想的局限性，在起义事业登上峰巅之时选择了妥协、招安，最终葬送了起义事业。小说通过宋江起义的失败客观上总结了封建时代农民起义失败的经验教训。
				小说以高俅发迹作为故事的开端，意在表明“乱自上作”，高俅是封建统治集团的代表人物。作者还写了大批的贪官污吏和地方恶霸，正是他们狼狈为奸，鱼肉百姓，才迫使善良而正直的人们不得不挺而走险，奋起反抗。小说深刻地挖掘出了封建时代农民起义的深层原因。[2] 
				《水浒传》以农民起义的发生、发展过程为主线，通过各个英雄被逼上梁山的不同经历，描写出他们由个体觉醒到走上小规模联合反抗，到发展为盛大的农民起义队伍的全过程，表现了“官逼民反”这一封建时代农民起义的必然规律，塑造了农民起义领袖的群体形象，深刻反映出北宋末年的政治状况和社会矛盾。
				作者站在被压迫者一边，歌颂了农民起义领袖们劫富济贫、除暴安良的正义行为，肯定了他们敢于造反、敢于斗争的革命精神。宋江原是一位周急扶困的义士，当他被逼上梁山之后，“替天行道”，壮大了起义军的声威，取得了一系列胜利。但由于他性格的二重性和思想的局限性，在起义事业登上峰巅之时选择了妥协、招安，最终葬送了起义事业。小说通过宋江起义的失败客观上总结了封建时代农民起义失败的经验教训。
				小说以高俅发迹作为故事的开端，意在表明“乱自上作”，高俅是封建统治集团的代表人物。作者还写了大批的贪官污吏和地方恶霸，正是他们狼狈为奸，鱼肉百姓，才迫使善良而正直的人们不得不挺而走险，奋起反抗。小说深刻地挖掘出了封建时代农民起义的深层原因。[2] 
				《水浒传》以农民起义的发生、发展过程为主线，通过各个英雄被逼上梁山的不同经历，描写出他们由个体觉醒到走上小规模联合反抗，到发展为盛大的农民起义队伍的全过程，表现了“官逼民反”这一封建时代农民起义的必然规律，塑造了农民起义领袖的群体形象，深刻反映出北宋末年的政治状况和社会矛盾。
				作者站在被压迫者一边，歌颂了农民起义领袖们劫富济贫、除暴安良的正义行为，肯定了他们敢于造反、敢于斗争的革命精神。宋江原是一位周急扶困的义士，当他被逼上梁山之后，“替天行道”，壮大了起义军的声威，取得了一系列胜利。但由于他性格的二重性和思想的局限性，在起义事业登上峰巅之时选择了妥协、招安，最终葬送了起义事业。小说通过宋江起义的失败客观上总结了封建时代农民起义失败的经验教训。
				小说以高俅发迹作为故事的开端，意在表明“乱自上作”，高俅是封建统治集团的代表人物。作者还写了大批的贪官污吏和地方恶霸，正是他们狼狈为奸，鱼肉百姓，才迫使善良而正直的人们不得不挺而走险，奋起反抗。小说深刻地挖掘出了封建时代农民起义的深层原因。[2] 
			</p>
		</div>
	)
}
export default Article